Revit 2024 API
AnalyticalSurfaceBase.IsCurveLoopValid Method
 Checks if curve loop is valid for Analytical Panel.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2023
Syntax
C#
public static bool IsCurveLoopValid(
	CurveLoop profile
)
Visual Basic
Public Shared Function IsCurveLoopValid ( _
	profile As CurveLoop _
) As Boolean
Visual C++
public:
static bool IsCurveLoopValid(
	CurveLoop^ profile
)
Parameters
profile
Type: Autodesk.Revit.DB.CurveLoop
 The curve loop to be checked.
Return Value
 Returns true if curve loop is ok, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
AnalyticalSurfaceBase Class
Autodesk.Revit.DB.Structure Namespace